Heliobteixeira/botieyes/esp-idf/sdkconfig.defaults
# ESP32-S3 SPI Board Defaults
# ESP32-S3 with SSD1306 128x64 OLED (SPI) and WS2812 LED

# Board Selection
CONFIG_BOTIEYES_BOARD_ESP32S3_SPI=y

# Display Configuration (SPI)
CONFIG_BOTIEYES_OLED_PROTOCOL_SPI=y
CONFIG_BOTIEYES_OLED_SPI_MOSI=11
CONFIG_BOTIEYES_OLED_SPI_SCK=12
CONFIG_BOTIEYES_OLED_SPI_CS=10
CONFIG_BOTIEYES_OLED_SPI_DC=13
CONFIG_BOTIEYES_OLED_SPI_RST=14
CONFIG_BOTIEYES_OLED_SPI_FREQ=10000000

# LED Configuration (WS2812)
CONFIG_BOTIEYES_LED_TYPE_WS2812=y
CONFIG_BOTIEYES_LED_WS2812_GPIO=38

# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# WiFi Configuration
CONFIG_ESP32S3_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32S3_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32S3_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Task Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# NVS Configuration
CONFIG_NVS_ENCRYPTION=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
